<span style="font-size: 36px;">W4111_Spring_2025_002 - Introduction to Databases:<br>Non-Programming Track Project<br>Sprint 1

# Overview

# Initialization

## General Python Packages

In [1]:
import copy

In [2]:
import json

In [4]:
import pandas

In [5]:
import numpy

In [7]:
import pymysql
import sqlalchemy

In [8]:
%load_ext sql

## ipython-sql

In [15]:
# This is really annoying. An update of SQLAlchemy, ipython-sql or pymysql seems to have broken the SQL Magic.
# This is a temporary fix/hack.
#
%config SqlMagic.style = '_DEPRECATED_DEFAULT'

In [9]:
# Make sure that you set these values to the correct values for your installation and 
# configuration of MySQL
#
db_user = "root"
db_password = "dbuserdbuser"

In [10]:
# Create the URL for connecting to the database.
# Do not worry about the local_infile=1, I did that for wizard reasons that you should not have to use.
#
db_url = f"mysql+pymysql://{db_user}:{db_password}@localhost?local_infile=1"

In [11]:
# Initialize ipython-sql
#
%sql $db_url

In [14]:
# Your answer will be different based on the databases that you have created on your local MySQL instance.
#
%sql use db_book;
%sql show tables;

 * mysql+pymysql://root:***@localhost?local_infile=1
0 rows affected.
 * mysql+pymysql://root:***@localhost?local_infile=1
15 rows affected.

[('advisor',),
 ('classroom',),
 ('course',),
 ('department',),
 ('hw3_student',),
 ('hw3_student_simple_1',),
 ('hw3_student_simple_2',),
 ('instructor',),
 ('instructor_public',),
 ('prereq',),
 ('section',),
 ('student',),
 ('takes',),
 ('teaches',),
 ('time_slot',)]

## PyMySQL

In [16]:
default_mysql_conn = pymysql.connect(
    user=db_user,
    password=db_password,
    host="localhost",
    port=3306,
    cursorclass=pymysql.cursors.DictCursor,
    autocommit=True
)

In [17]:
cur = default_mysql_conn.cursor()

result = cur.execute("select * from db_book.student where dept_name='Comp. Sci.';");
result = cur.fetchall()
result_df = pandas.DataFrame(result)
result_df

      ID      name   dept_name tot_cred
0  00128     Zhang  Comp. Sci.      102
1  12345   Shankar  Comp. Sci.       32
2  54321  Williams  Comp. Sci.       54
3  76543     Brown  Comp. Sci.       58

In [18]:
from sqlalchemy import create_engine
default_engine = create_engine(db_url)

In [19]:
result_df = pandas.read_sql(
    "select * from db_book.student where dept_name='Comp. Sci.'", con=default_engine
)
result_df

      ID      name   dept_name  tot_cred
0  00128     Zhang  Comp. Sci.     102.0
1  12345   Shankar  Comp. Sci.      32.0
2  54321  Williams  Comp. Sci.      54.0
3  76543     Brown  Comp. Sci.      58.0

# Load the Data

## Setup Project Database/Schema

<span style="color: red; font-size: 24px;"><b>Warning:<br>This will delete any previous work you have done in the project database!<br>Be sure you want to do this.</span>

In [21]:
%%sql

drop schema if exists s25_project;
create schema s25_project;

use s25_project;

 * mysql+pymysql://root:***@localhost?local_infile=1
0 rows affected.
1 rows affected.
0 rows affected.

[]

## Initial Data Files